Reasno/ai-passport/sdkconfig.defaults.example
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app；用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# Debug only: set to y locally to enable tools/screenshot.py.
CONFIG_ENABLE_SCREENSHOT=n

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# 60 秒无操作后允许 FreeRTOS tickless idle 自动进入 Light Sleep。
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# 离开家庭 AP 后仍允许 ESP-NOW 按接收窗口周期唤醒设备。
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y

# --- Bluetooth LE ---
# 应用固件的配对、游戏、雷达和响铃均使用 ESP-NOW；永久 Recovery 分区
# 独立提供小程序 BLE 安装服务，不依赖应用固件中的 Bluetooth 协议栈。
# CONFIG_BT_ENABLED is not set

# --- Kids Points connectivity ---
CONFIG_WIFI_SSID="YOUR_WIFI_SSID_HERE"
CONFIG_WIFI_PASSWORD="YOUR_WIFI_PASSWORD_HERE"
CONFIG_MQTT_BROKER_HOST="192.168.31.111"
CONFIG_MQTT_BROKER_PORT=1883
CONFIG_KIDS_ACTOR_BROTHER=y
CONFIG_ACTOR_CHILD_ID="brother"
# 隐私配置：这里只保留占位值；请把真实姓名写入已被 .gitignore 忽略的 sdkconfig.defaults。
CONFIG_KP_CHILD_NAME="小朋友"
CONFIG_KP_CHILD_ROLE="哥哥"
